import 'package:flutter/material.dart';

void main() {
  runApp(App());
}

class App extends StatelessWidget {
  // This widget is the root of your application.
  @override
  Widget build(BuildContext context) {

    return MaterialApp(
      title: 'my first flutter',
      home: Scaffold(
        appBar: AppBar(title: Text('adf')),
        body: Home(),
      ),
    );
  }
}
class Home extends StatelessWidget {
  Widget build (BuildContext context) {
    return Stack(
      children: [
        SingleChildScrollView(
           child: Container(
             padding: EdgeInsets.all(20),
             child: Text(
                 '''体育课与青少年成长息息相关。多年来，要求改革体育课的呼声一直不绝于耳。

目前，我国多数地区小学1～2年级每周4课时体育课，小学3～6年级和初中每周3课时体育课，高中每周2课时体育课。

全国政协委员朱鼎健认为，这些课时仅能满足最基本的体育教学，对学生个性化的体育特长培养难以保障。所以，他建议在小学阶段增加体育课课时，以每周5课时为宜，保证小学生每天都有1小时运动时间，这将对全面提升学生体质健康水平起着重要作用。

多年以来，我国中小学的体育教学模式都是依据体育教学大纲，制定出教学目标、教学内容、教学方式以及组织形式，然后统一实施。

朱鼎健委员向中国新闻周刊表示，上述教学模式没有结合学生主体情况的差异，学生特长没有得到发挥，统一化的教学也会让学生感觉“被运动”。所以，他建议体育课的授课内容也应突破田径传统项目，实现项目的多元化。

此外，对于体育中考，朱鼎健委员呼吁，在更多地区推广和全面采晋江有很多老牌作者，接触久了，就会发现她们不仅笔名取得好，连角色名都起得恰到好处。很多也喜欢写小说的爱好者不仅感叹，为什么人家起名那么绝，到了自己就抓耳挠腮呢。其实这些烦恼，现在的大神级别作者一开始都遇到过。 今天就来说说，晋江老牌作者笔名由来和角色取名习惯。

淮上


淮上的名字听上去是不是特别高大上、文艺范？有粉丝称淮上的名字由来，是因为淮上喜欢吃“淮上汤包”。还有粉丝称是因为淮上小时候家附近有一家“淮上包子铺”。不管是哪个原因，瞬间打破了缘原有的滤镜，直接降低了一个档次，变得朴实接地气了。同时，也补充了一个小知识，那就是“淮上”还是一个地名。


淮上给角色们起名喜欢用生僻字， 如《破云》中的严峫、闻韶；《吞海》中的吴雩、林炡。 可能对我们来说，这些字不常见，对淮上来说不一定是生僻字。淮上可是墨尔本皇家理工大学大学毕业的。

其实淮上给其他角色名起得也挺文艺好听，比如江停、楚慈、周戎、司南等，有种古风的韵味。

巫哲


巫哲的笔名一开始听上去像男生，也挺文艺范。听说，巫哲取这个笔名，是因为一开始想写玄幻文，结果写的文大多都是近现代的，文风一直很稳定，以真实、细腻、治愈为主。

巫哲的笔名挺好的，给自家角色起名就比较搞笑了，都有规律可循。

比如带方位的：沈东、边南、项西、徐北、顾中。

比如带“一”的：初一、秦一、宋一、伍一等。

还有带“飞”的：顾飞、夏飞、万分、给XX飞。


粉丝们吐槽巫哲起名太费事，不如种草养花养狗。是因为巫哲的日常全是晒生活的，虽然大家从没有见过巫哲长什样，声音是什么样的，但却见全了狗蛋家的角角落落花花草草，甚至每天都能知道狗蛋家的傻狗又犯了什么错。

priest


所以，大家都明白了吧，不仅我们有起名苦难症，这些大神级的作者曾经对笔名和角色名都头疼过。

比如priest，P大也因为笔名难受过，因为中文名字都被人取了，翻牛津字典翻到什么就打算取什么，结果翻到了priest。

谐音派


还有绿野千鹤和木苏里干脆给角色名字用谐音，真的超有梗，又有趣。

比如《全球高考》中的于闻，狄黎，舒雪，吴俐，谐音则是语文、地理、数学、物理。

《迪奥先生》中的气死你，焦栖和娇妻，阙德医生和缺德医生，还有张知识、李英俊、高石庆等……

想了解更多作者故事，点击上方关注：宁宁漫圈就够了。

举报/反馈
发表评论
发表神评妙论
发表
评论列表（102条）
愿以山河聘
西子绪:沈一穷 沈二白 沈朝三 沈暮四 程一谢 程千里      
02-28 09:00
回复
1186
不知道o1
还有吴推三 吴阻四 吴没五 《为了和谐而奋斗》也是西子绪写的《我五行缺你》就是根据和谐的世界拓展出来的。好看，你见过系统会嗑瓜子吗？还把自己磕傻了，回炉再造，哈哈哈
5分钟前
回复
赞
一鹿伴晗lhtwp
一谢千里真的笑死我
03-03 23:07
回复
4
全部10条回复 
At绝世黄瓜
夏司逆，甄琮明，矅敛   
02-28 00:38
回复
942
宁宁漫圈作者
动漫达人,优质创作者
我还以为都开学了，等半天等不到评论
02-28 01:11
回复
9
夷陵见狗马上怂
啊啊啊哇哇哇两座山
19小时前
回复
1
全部12条回复 
云徵
所以说巫哲真的很喜欢飞啊 撒野的歌词:我一脚踏空，我就要飞起来了。还有小说主角们的名字
02-28 15:46
回复
315
蕶亂次可爱长大a
hhh
03-03 23:02
回复
赞
望仔他家的长白山神树
还有轻狂里寇家祖传的给老子飞
03-02 20:58
回复
11
全部4条回复 
'''
             ),
           )
        ),
        Positioned(
          right: 10,
          bottom: 10,
          child: IconButton(
            color: Colors.red,
            icon: Icon(Icons.favorite),
            onPressed: (){},
          ),
        )
      ],
    );
  }
}